Description: Downloads the latest version of the DisplayLink Manager App.
Identifier: com.github.smithjw.download.DisplayLink_Manager
MinimumVersion: '2.3'

Input:
  NAME: DisplayLink Manager
  SOFTWARE_TITLE: DisplayLink_Manager
  BASE_URL: https://www.synaptics.com
  SEARCH_URL: products/displaylink-graphics/downloads/macos
  RE_PATTERN_1: /products/displaylink-.+\?filetype=exe
  RE_PATTERN_2: <a.*href="(?P<download_url>.*[.]zip)" download>Accept<\/a>
  LOGIN_EXTENSION_URL: https://www.synaptics.com/sites/default/files/exe_files/2021-02/macOS%20App%20LoginExtension-EXE.dmg

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%RE_PATTERN_1%'
      url: '%BASE_URL%/%SEARCH_URL%'

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%RE_PATTERN_2%'
      url: '%BASE_URL%%match%'

  - Processor: URLDownloader
    Arguments:
      filename: '%SOFTWARE_TITLE%.zip'
      url: '%BASE_URL%%download_url%'

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: true

  - Processor: URLDownloader
    Arguments:
      filename: '%SOFTWARE_TITLE%_Extension.dmg'
      url: '%LOGIN_EXTENSION_URL%'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%_Extension.dmg/*.pkg'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: DisplayLink Corp (73YQY62QM3)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%RECIPE_CACHE_DIR%/unpack/*.pkg'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: DisplayLink Corp (73YQY62QM3)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%_Extension.dmg/%found_basename%'
