Description: Downloads the latest version of the DisplayLink Manager App.
Identifier: com.github.smithjw.pkg.DisplayLink_Manager
ParentRecipe: com.github.smithjw.download.DisplayLink_Manager
MinimumVersion: '2.3'

Input:
  NAME: DisplayLink Manager
  SOFTWARE_TITLE: DisplayLink_Manager

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%'
      pkgdirs:
        pkgroot: '0775'
        Scripts: '0775'

  - Processor: com.github.mlbz521.SharedProcessors/XarExtractSingleFile
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg'
      file_to_extract: Distribution

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      xml_file: '%extracted_file%'
      xpath: './/pkg-ref[@id="com.displaylink.displaylinkmanagerapp"]/bundle-version/bundle[@path="DisplayLink Manager.app"]'
      attribute_one: CFBundleShortVersionString
      return_variable_attribute_one: version

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      xml_file: '%extracted_file%'
      xpath: './/os-version[@min]'
      attribute_one: min
      return_variable_attribute_one: minimum_os_version

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts/%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%_Extension.dmg/*.pkg'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%_Extension.dmg/%found_basename%'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts/%SOFTWARE_TITLE%_Extension-%version%.pkg'

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts/postinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash

        SCRIPT_DIR="$(dirname "$0")"
        DISPLAYLINK_PKG="$SCRIPT_DIR/%SOFTWARE_TITLE%-%version%.pkg"
        DISPLAYLINK_EXTENSION_PKG="$SCRIPT_DIR/%SOFTWARE_TITLE%_Extension-%version%.pkg"

        echo "Installing DisplayLink Manager..."
        /usr/sbin/installer -pkg "$DISPLAYLINK_PKG" -target "$3"
        MAIN_EXIT_CODE=$?

        if [ $MAIN_EXIT_CODE -eq 0 ]; then
            echo "Installing DisplayLink Extension..."
            /usr/sbin/installer -pkg "$DISPLAYLINK_EXTENSION_PKG" -target "$3"
            EXTENSION_EXIT_CODE=$?

            if [ $EXTENSION_EXIT_CODE -eq 0 ]; then
                echo "Both DisplayLink packages installed successfully"
                exit 0
            else
                echo "DisplayLink Extension installation failed with exit code: $EXTENSION_EXIT_CODE"
                exit $EXTENSION_EXIT_CODE
            fi
        else
            echo "DisplayLink Manager installation failed with exit code: $MAIN_EXIT_CODE"
            exit $MAIN_EXIT_CODE
        fi

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: 'com.displaylink.displaylinkmanagerapp'
        version: '%version%'
        pkgname: '%SOFTWARE_TITLE%-%version%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgroot: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/pkgroot'
        scripts: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%'
        - '%RECIPE_CACHE_DIR%/extractedfile'
