Description: Downloads the latest version of the DisplayLink Manager App.
Identifier: com.github.smithjw.download.DisplayLink_Manager
MinimumVersion: '2.9'

Input:
  NAME: DisplayLink Manager
  SOFTWARE_TITLE: DisplayLink_Manager
  BASE_URL: https://www.synaptics.com
  SEARCH_URL: products/displaylink-graphics/downloads/macos
  RE_PATTERN_1: /products/displaylink-.+\?filetype=exe
  RE_PATTERN_2: <a.*href="(?P<download_url>.*[.]pkg)" download>Accept<\/a>
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%RE_PATTERN_1%'
      url: '%BASE_URL%/%SEARCH_URL%'

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%RE_PATTERN_2%'
      url: '%BASE_URL%%match%'

  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.pkg'
      url: '%BASE_URL%%download_url%'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: DisplayLink Corp (73YQY62QM3)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg'
