Description: Downloads the latest version of the DisplayLink Manager App.
Identifier: com.github.smithjw.pkg.DisplayLink_Manager
ParentRecipe: com.github.smithjw.download.DisplayLink_Manager
MinimumVersion: '2.3'

Input:
  NAME: DisplayLink Manager
  SOFTWARE_TITLE: DisplayLink_Manager

Process:
  - Processor: com.github.mlbz521.SharedProcessors/XarExtractSingleFile
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg'
      file_to_extract: Distribution

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      xml_file: '%extracted_file%'
      xpath: './/pkg-ref[@id="com.displaylink.displaylinkmanagerapp"]/bundle-version/bundle[@path="DisplayLink Manager.app"]'
      attribute_one: CFBundleShortVersionString
      return_variable_attribute_one: version

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%'
        - '%RECIPE_CACHE_DIR%/extractedfile'
