Description: Downloads the latest version of the DisplayLink Manager App.
Identifier: com.github.smithjw.download.DisplayLink_Manager
MinimumVersion: '2.3'

Input:
  NAME: DisplayLink Manager
  SOFTWARE_TITLE: DisplayLink_Manager
  DOWNLOAD_URL: https://www.displaylink.com/downloads

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: DisplayLink Manager Graphics Connectivity\s.*\s.*\s.*\s.*\s.*\s.*\s.*\s.*\s.*\s.*\s.*a href=\"\/downloads\/file\?id=(\d+)\" title=\"Download File\" onclick=\"\" class=\"download-link\"><button>Download<\/button><\/a>
    url: '%DOWNLOAD_URL%/macos'

- Processor: URLDownloader
  Arguments:
    curl_opts:
    - -F
    - fileId=%match%
    - -F
    - accept_submit=Accept
    - --location
    filename: '%SOFTWARE_TITLE%.pkg'
    url: '%DOWNLOAD_URL%/file?id=%match%'

- Processor: EndOfCheckPhase

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/downloads/*.pkg'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: DisplayLink Corp (73YQY62QM3)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%found_filename%'
