Description: Downloads the latest version of the DisplayLink Manager App.
Identifier: com.github.smithjw.pkg.DisplayLink_Manager
ParentRecipe: com.github.smithjw.download.DisplayLink_Manager
MinimumVersion: '2.3'

Input:
  NAME: DisplayLink Manager
  DOWNLOAD_URL: https://www.displaylink.com/downloads

Process:
  - Processor: com.github.mlbz521.SharedProcessors/XarExtractSingleFile
    Arguments:
      archive_path: '%pathname%'
      file_to_extract: Distribution

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      xml_file: '%extracted_file%'
      xpath: './/bundle[@id="com.displaylink.DisplayLinkUserAgent"][@CFBundleShortVersionString]'
      attribute_one: CFBundleShortVersionString
      return_variable_attribute_one: version

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/extractedfile'
