Description: Downloads the current version of the individual Office-Reset package of your choice, renames it, then uploads to Jamf Pro.
Comment: |
  By default, this recipe is set to download the reset package for the complete Microsoft Office suite. Valid options for SOFTWARE_TITLE are as follows:
    - Office_Factory
    - Word
    - Excel
    - PowerPoint
    - Outlook
    - OneNote
    - OneDrive
    - Teams
    - License
    - AutoUpdate
Identifier: com.github.smithjw.jamf.Office_Reset
ParentRecipe: com.github.smithjw.pkg.Office_Reset
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Office
  SOFTWARE_TITLE: Office_Factory
  CATEGORY: Utilities
  GROUP_NAME: '%SOFTWARE_TITLE%-update-smart'
  GROUP_TEMPLATE: SmartGroup-update-smart.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: Policy-install-latest.xml
  POLICY_NAME: 'Reset %NAME%'
  POLICY_RUN_COMMAND: ' '
  SELF_SERVICE_DISPLAY_NAME: 'Reset %NAME%'
  SELF_SERVICE_DESCRIPTION:
    '"The %NAME% Reset policy will revert %NAME% back to its
    original state leving behind only the application''s app bundle. This will remove:


    - All user-preferences

    - Group/per-app containers

    - Temporary caches

    - Heychain entries

    - Mailbox content (Office & Outlook Office-Reset packages)"
    '
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  UPDATE_PREDICATE: 'pkg_uploaded == False'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/Microsoft_%SOFTWARE_TITLE%_Reset-%version%.pkg'
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
