Description: Downloads the latest version of Plantronics Hub.
Identifier: com.github.smithjw.pkg.plantronics_hub
ParentRecipe: com.github.ahousseini-recipes.download.PlantronicsHub
MinimumVersion: '2.3'

Input:
  NAME: Plantronics Hub
  SOFTWARE_TITLE: Plantronics_Hub

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%/Plantronics Software.pkg'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/version_check'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/inner.pkg/Payload'

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/version_check/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
    source_pkg: '%pathname%/Plantronics Software.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
    - '%RECIPE_CACHE_DIR%/version_check'
