<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of the Box Drive app</string>
		<key>Identifier</key>
		<string>com.github.smithjw.download.BoxDrive</string>
		<key>Input</key>
		<dict>
			<key>DOWNLOAD_URL</key>
			<string>https://e3.boxcdn.net/box-installers/desktop/releases/mac/Box.pkg</string>
			<key>NAME</key>
			<string>Box Drive</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.pkg</string>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/expand</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/expand/BoxDesktopDrive.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/expand/payload</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/expand/payload/Box.app/Contents/Info.plist</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%pathname%</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
