<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of the Thunderbolt 3 Dock Utility</string>
		<key>Identifier</key>
		<string>com.github.smithjw.download.Thunderbolt3DU</string>
		<key>Input</key>
		<dict>
			<key>DOWNLOAD_URL</key>
			<string>https://update.elgato.com/mac/thunderbolt-dock-update/download.php</string>
			<key>NAME</key>
			<string>Thunderbolt 3 Dock Utility</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.pkg</string>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/expand</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/Applications/Elgato Thunderbolt Dock Utility.app</string>
					<key>requirement</key>
					<string>anchor apple generic and identifier "com.elgato.Elgato-Thunderbolt-Dock-Utility" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Y93VXCB8Q5)</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/expand/ElgatoThunderboltDockUtility.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/Applications/Elgato Thunderbolt Dock Utility.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%pathname%</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
