<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.smithjw.jss.Thunderbolt3DU-selfservice</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string></string>
		<key>GROUP_TEMPLATE</key>
		<string></string>
		<key>POLICY_CATEGORY</key>
		<string>Applications</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate-selfservice.xml</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.smithjw.jss.Thunderbolt3DU</string>
</dict>
</plist>
