Description: Downloads the latest version of HandBrake, packages it, signs it, then imports into your Jamf instance.
Identifier: com.github.smithjw.jss.Handbrake
ParentRecipe: com.github.smithjw.sign.Handbrake
MinimumVersion: '2.3'

Input:
  NAME: Handbrake
  CATEGORY: Applications
  GROUP_NAME: App Update - %NAME%
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  POLICY_CATEGORY: Testing - App QA
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: 'HandBrake is a tool for converting video from nearly any
    format to a selection of modern, widely supported codecs.'
  SELF_SERVICE_ICON: '%NAME%.png'
  SIGNING_CERTIFICATE: Override_This_Value

Process:
- Processor: JSSImporter
  Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    self_service_icon: '%SELF_SERVICE_ICON%'
