Comment: |
  Modify the ARCHITECTURE key and DOWNLOAD_TYPE to determine whether the Intel (amd64) or Apple Silicon (arm64) version
  of Webex is downloaded. Defaults to Intel if not overridden.
  eg "--key ARCHITECTURE=arm64"
  Intel: WebexTeamsDesktop-MACOS-Gold
  Apple Silicon: WebexDesktop-MACOS-Apple-Silicon-Gold
  https://binaries.webex.com/WebexDesktop-MACOS-Apple-Silicon-Gold/Webex.dmg
  https://binaries.webex.com/WebexTeamsDesktop-MACOS-Gold/Webex.dmg
Description: Downloads the latest version of Webex, packages it, then installs.
Identifier: com.github.smithjw.install.webex
ParentRecipe: com.github.smithjw.sign.webex
MinimumVersion: '2.3'

Input:
  NAME: Webex

Process:
- Processor: Installer
