Description: Downloads the latest version of Webex and creates a package.
Identifier: com.github.smithjw.pkg.webex
ParentRecipe: com.github.smithjw.download.webex
MinimumVersion: '2.3'

Input:
  NAME: Webex

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%pathname%/Webex.app'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%-%version%.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/payload'