Identifier: com.github.smithjw.sign.draw.io
ParentRecipe: com.github.fishd72.pkg.DrawIO
MinimumVersion: '2.3'

Input:
  SIGNING_CERTIFICATE: Override_This_Value

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: '%pkg_path%'
      signing_cert: '%SIGNING_CERTIFICATE%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/%NAME%-%version%-unsigned.pkg'
