Description: Downloads the latest version of NSLogger, packages it, signs it, then imports into your Jamf instance.
Identifier: com.github.smithjw.jss.NSLogger
ParentRecipe: com.github.smithjw.sign.NSLogger
MinimumVersion: '2.3'

Input:
  NAME: NSLogger
  CATEGORY: Development
  GROUP_NAME: App Update - %NAME%
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  POLICY_CATEGORY: Testing - App QA
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: 'NSLogger is a high performance logging utility which displays traces emitted by client applications running on macOS, iOS and Android. It replaces traditional console logging traces (NSLog(), Java Log).'
  SELF_SERVICE_ICON: '%NAME%.png'

Process:
- Processor: JSSImporter
  Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    self_service_icon: '%SELF_SERVICE_ICON%'
