Description: Downloads the latest version of NSLogger and creates a package.
Identifier: com.github.smithjw.pkg.NSLogger
ParentRecipe: com.github.smithjw.download.NSLogger
MinimumVersion: '2.3'

Input:
  NAME: NSLogger

Process:
  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads'

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.app'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/downloads/%NAME%.app'
