Description: Downloads the latest version of NSLogger and creates a package.
Identifier: com.github.smithjw.pkg.NSLogger
ParentRecipe: com.github.smithjw.download.NSLogger
MinimumVersion: '2.3'

Input:
  NAME: NSLogger

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.app'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/downloads/%NAME%.app'
        - '%RECIPE_CACHE_DIR%/payload'
