Comment: |
  Use the ARCHITECTURE key to determine whether the Intel (amd64) or Apple Silicon (arm64) version
  of Docker for Mac is downloaded. Defaults to Intel if not overridden.
  eg "--key ARCHITECTURE=arm64"
Description: Downloads the latest version of Docker.
Identifier: com.github.smithjw.download.Docker
MinimumVersion: '2.3'

Input:
  NAME: Docker
  ARCHITECTURE: amd64

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%ARCHITECTURE%.dmg'
    url: https://desktop.docker.com/mac/main/%ARCHITECTURE%/Docker.dmg

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Docker.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
