---
Comment: |
  Utilises Shared Processors from https://github.com/jgstew/jgstew-recipes
  Use the ARCHITECTURE and DOWNLOAD_TYPE keys to determine whether the Intel (amd64) or Apple Silicon (arm64) version
  of Docker for Mac is downloaded. Defaults to Intel if not overridden.
  Intel: "--key ARCHITECTURE=x86_64 --key DOWNLOAD_TYPE=amd64"
  Apple Silicon: "--key ARCHITECTURE=arm64 --key DOWNLOAD_TYPE=arm64"
Description: Downloads the latest version of Docker.
Identifier: com.github.smithjw.download.Docker
MinimumVersion: '2.9'

Input:
  NAME: Docker
  ARCHITECTURE: arm64
  DOWNLOAD_TYPE: arm64
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: 'Docker-%ARCHITECTURE%.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: 'https://desktop.docker.com/mac/main/%DOWNLOAD_TYPE%/Docker.dmg'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/downloads/Docker-%ARCHITECTURE%.dmg/Docker.app'
      deep_verification: true
      strict_verification: true
      requirement: anchor apple generic and identifier "com.docker.docker" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9BNSXJN65R")
