<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Comment</key>
    <string>Use the ARCHITECTURE key to determine whether the Intel (amd64) or Apple Silicon (arm64) version
    of Docker for Mac is downloaded. Defaults to Intel if not overridden.
    eg --key ARCHITECTURE=arm64</string>
    <key>Description</key>
    <string>Downloads the latest version of Docker.</string>
    <key>Identifier</key>
    <string>com.github.smithjw.download.Docker</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Docker</string>
      <key>ARCHITECTURE</key>
      <string>amd64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%NAME%-%ARCHITECTURE%.dmg</string>
          <key>url</key>
          <string>https://desktop.docker.com/mac/stable/%ARCHITECTURE%/Docker.dmg</string>
        </dict>
        <key>Processor</key>
        <string>URLDownloader</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <!-- <dict>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%pathname%/Docker.app</string>
          <key>requirement</key>
          <string>anchor apple generic and identifier "com.docker.docker" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9BNSXJN65R")</string>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
      </dict> -->
      <dict>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%pathname%/Docker.app/Contents/Info.plist</string>
          <key>plist_version_key</key>
          <string>CFBundleShortVersionString</string>
        </dict>
        <key>Processor</key>
        <string>Versioner</string>
      </dict>
    </array>
  </dict>
</plist>