---
Description: Downloads the latest version of Docker and imports it into Munki.
Identifier: com.github.smithjw.munki.Docker
ParentRecipe: com.github.smithjw.pkg.Docker
MinimumVersion: '2.3'

Input:
  NAME: Docker
  ARCHITECTURE: x86_64
  MUNKI_REPO_SUBDIR: apps/%NAME%-%ARCHITECTURE%
  pkginfo:
    catalogs:
      - testing
    description: Spice up your Dock a little.
    developer: Docker Inc
    display_name: Docker
    name: '%NAME%-%ARCHITECTURE%'
    unattended_install: true
    supported_architectures:
      - '%ARCHITECTURE%'

Process:
  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/downloads/Docker-%ARCHITECTURE%.dmg/*.app'

  - Processor: Copier
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/Applications/%dmg_found_filename%'
      source_path: '%RECIPE_CACHE_DIR%/downloads/Docker-%ARCHITECTURE%.dmg/%dmg_found_filename%'

  - Processor: MunkiInstallsItemsCreator
    Arguments:
      derive_minimum_os_version: true
      faux_root: '%RECIPE_CACHE_DIR%'
      installs_item_paths:
        - /Applications/Docker.app

  - Processor: MunkiPkginfoMerger

  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pkg_path%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%RECIPE_CACHE_DIR%/Applications'
