Description: Downloads the latest version of Kap and creates a package.
Identifier: com.github.smithjw.pkg.Kap
ParentRecipe: com.github.smithjw.download.Kap
MinimumVersion: '2.3'

Input:
  NAME: Kap

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%-%version%.pkg'
