Comment: DOWNLOAD_ARCHITECTURE should be x64 or arm64
Description: Downloads the latest version of Kap from GitHub.
Identifier: com.github.smithjw.download.Kap
MinimumVersion: '2.3'

Input:
  NAME: Kap
  DOWNLOAD_ARCHITECTURE: x64

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: Consider switching to the Kap recipes in the wardsparadox-recipes repo. This recipe is deprecated and will be removed in the future.

  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: 'wulkano/kap'
      asset_regex: '%NAME%-[0-9]+.[0-9]+.[0-9]+-%DOWNLOAD_ARCHITECTURE%.dmg'

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/Kap.app'
      requirement: identifier "com.wulkano.kap" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2KEEHXF6R6"
