Description: Runs the seedutil command to enrol the device into a macOS beta. Valid enrolment options are DeveloperSeed, CustomerSeed, PublicSeed
Identifier: com.github.smithjw.jamf.Enable_macOS_Beta
MinimumVersion: '2.3'

Input:
  NAME: Enable macOS Beta
  CATEGORY: Developer
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroup-update-smart.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: Policy-install-script-only.xml
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  SCRIPT_NAME: 'Enable_macOS_Beta.sh'
  SCRIPT_PRIORITY: 'After'
  SCRIPT_PARAMETER4_TITLE: 'Seed Version'
  SCRIPT_PARAMETER4_VALUE: 'DeveloperSeed'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_DESCRIPTION: 'Enrolls this mac in the macOS Beta Program'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SOFTWARE_TITLE: 'Enable_macOS_Beta'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  EXTENSION_ATTRIBUTE_SCRIPT: EA-macOS_beta_seed.sh
  EXTENSION_ATTRIBUTE_NAME: macOS Beta Seed

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: '%SELF_SERVICE_CATEGORY%'
      script_path: '%SCRIPT_NAME%'
      script_priority: '%SCRIPT_PRIORITY%'
      script_parameter4: '%SCRIPT_PARAMETER4_TITLE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_name: '%EXTENSION_ATTRIBUTE_NAME%'
      ea_script_path: '%EXTENSION_ATTRIBUTE_SCRIPT%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
