<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Viscosity and builds a package. Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.smithjw-recipes.jss.selfservice.Viscosity</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Utility</string>
		<key>MAJOR_VERSION</key>
		<string>1</string>
		<key>NAME</key>
		<string>Viscosity</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.12.x,10.11.x,10.10.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Utility</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate-selfservice.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Viscosity is a VPN CLient</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Viscosity.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>~/code/smithjw-recipes/Viscosity.pkg.recipe</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
