Description: Uses parent pkg recipe to download latest GoogleChrome and import it into the JSS.
Identifier: com.github.smithjw.jss.Nessus_Agent
ParentRecipe: com.github.smithjw.pkg.Nessus_Agent
MinimumVersion: '2.3'

Input:
  NAME: Nessus Agent
  CATEGORY: Security
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: Nessus Agents are lightweight programs installed locally on a host – a laptop, virtual system, desktop, and/or server. Agents receive scanning instructions from a central Nessus Manager server, perform scans locally, and report vulnerability, compliance and system results back to the central server.
  SELF_SERVICE_ICON: '%NAME%.png'

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: JSS Recipes will cease working soon and this recipe will be removed on the 30th of September

  - Processor: JSSImporter
    Arguments:
      category: '%CATEGORY%'
      groups:
        - name: '%GROUP_NAME%'
          smart: true
          template_path: '%GROUP_TEMPLATE%'
      policy_category: '%POLICY_CATEGORY%'
      policy_template: '%POLICY_TEMPLATE%'
      prod_name: '%NAME%'
      self_service_description: '%SELF_SERVICE_DESCRIPTION%'
      self_service_icon: '%SELF_SERVICE_ICON%'
