<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of PDFPen and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.smithjw.pkg.PDFPen</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>PDFPen</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.5</string>
		<key>ParentRecipe</key>
		<string>com.github.jessepeterson.PDFpen.download</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
				</dict>
			</dict>
			<dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/PDFPen.app</string>
                </dict>
            </dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pkgroot%/Applications/PDFPen.app/PDFPen.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>version</key>
						<string>%version%</string>
						<key>id</key>
						<string>com.viscosity</string>
						<key>chown</key>
						<array>
							<dict>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>admin</string>
							</dict>
						</array>
					</dict>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
