Description: Downloads the latest version of Xray Exploratory App and imports it into your JSS.
Identifier: com.github.smithjw.jss.Xray_Exploratory_App
ParentRecipe: com.github.smithjw.sign.Xray_Exploratory_App
MinimumVersion: '2.3'

Input:
  NAME: Xray Exploratory App
  CATEGORY: Productivity
  GROUP_NAME: '%SOFTWARE_TITLE%-update-smart'
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: 'Great quality comes from critical thinking. Unleash your inner bounty hunter with Exploratory Testing for Jira & Confluence'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SOFTWARE_TITLE: Xray_Exploratory_App

Process:
  - Processor: JSSImporter
    Arguments:
      category: '%CATEGORY%'
      groups:
        - name: '%GROUP_NAME%'
          smart: true
          template_path: '%GROUP_TEMPLATE%'
      policy_category: '%POLICY_CATEGORY%'
      policy_template: '%POLICY_TEMPLATE%'
      prod_name: '%NAME%'
      self_service_description: '%SELF_SERVICE_DESCRIPTION%'
      self_service_icon: '%SELF_SERVICE_ICON%'
