Description: Downloads the latest version of Xray Exploratory App, creates a package, then signs it.
Identifier: com.github.smithjw.sign.Xray_Exploratory_App
ParentRecipe: com.github.smithjw.pkg.Xray_Exploratory_App
MinimumVersion: '2.3'

Input:
  SIGNING_CERTIFICATE: Override_This_Value
  SOFTWARE_TITLE: Xray_Exploratory_App

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: '%pkg_path%'
      signing_cert: '%SIGNING_CERTIFICATE%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%-unsigned.pkg'
