Description: Downloads the latest version of Xray Exploratory App, creates a package, then signs it.
Identifier: com.github.smithjw.sign.xray_exploratory_app
ParentRecipe: com.github.smithjw.pkg.xray_exploratory_app
MinimumVersion: '2.3'

Input:
  SIGNING_CERTIFICATE: Override_This_Value
  SOFTWARE_TITLE: Xray_Exploratory_App

Process:

- Processor: com.github.rtrouton.SharedProcessors/PkgSigner
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
    signing_cert: '%SIGNING_CERTIFICATE%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%-unsigned.pkg'
