Description: Downloads the latest version of GitHub Desktop and creates a package.
Identifier: com.github.smithjw.pkg.github_desktop
ParentRecipe: com.github.smithjw.download.github_desktop
MinimumVersion: '2.3'

Input:
  NAME: GitHub Desktop
  SOFTWARE_TITLE: GitHub_Desktop

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%.app'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%ARCHITECTURE%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
