Description: Downloads the latest versions (ARM and INTEL) of GitHub Desktop.
Identifier: com.github.smithjw.download.GitHub_Desktop-Universal
MinimumVersion: '2.9'

Input:
  NAME: GitHub Desktop
  SOFTWARE_TITLE: GitHub_Desktop
  URL_ARM64: https://central.github.com/deployments/desktop/desktop/latest/darwin-arm64
  URL_X86_64: https://central.github.com/deployments/desktop/desktop/latest/darwin
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-arm64.zip'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_ARM64%'

  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-x86_64.zip'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_X86_64%'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-arm64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/arm64'
      purge_destination: true

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-x86_64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/x86_64'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/arm64/GitHub Desktop.app'
      requirement: '(identifier "com.github.GitHub" or identifier "com.github.GHAskPass") and anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VEKTX9H2N7'
      deep_verification: true
      strict_verification: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/GitHub Desktop.app'
      requirement: '(identifier "com.github.GitHub" or identifier "com.github.GHAskPass") and anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VEKTX9H2N7'
      deep_verification: true
      strict_verification: true

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/arm64/GitHub Desktop.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString
