Description: |
  Downloads both arm64 and x86_64 versions of GitHub Desktop, wraps them into a
  universal installer pkg, and uploads the resulting pkg to Jamf Pro. Old
  packages matching PKG_NAME_MATCH are pruned to keep the most recent
  PKG_TO_KEEP versions.

  This recipe stops at "upload + cleanup". Downstream override repos own their
  own policy / scope. Run as part of the full download -> pkg -> upload chain
  so URLDownloaderPython's HTTP cache can short-circuit unchanged builds.
Identifier: com.github.smithjw.jamf.upload.GitHub_Desktop-Universal
ParentRecipe: com.github.smithjw.pkg.GitHub_Desktop-Universal
MinimumVersion: '2.9'

Input:
  NAME: GitHub Desktop
  SOFTWARE_TITLE: GitHub_Desktop
  CATEGORY: Apps
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  PKG_TO_KEEP: '2'
  PKG_NAME_MATCH: '%SOFTWARE_TITLE%-Universal-'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
