Description: Downloads latest Google Chrome enterprise package.
Identifier: com.github.smithjw.download.Google_Chrome
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome
  DOWNLOAD_URL: https://dl.google.com/dl/chrome/mac/universal/stable/gcem/GoogleChrome.pkg
  SOFTWARETITLE: Google_Chrome
  PKGPAYLOADNAME: GoogleChrome

Process:
  - Processor: URLDownloader
    Arguments:
      filename: '%SOFTWARETITLE%.pkg'
      url: '%DOWNLOAD_URL%'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      strict_verification: true
      requirement: (identifier "com.google.Chrome" or identifier "com.google.Chrome.beta" or identifier "com.google.Chrome.dev" or identifier "com.google.Chrome.canary") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV
      input_path: '%pathname%'
