Description: Uses parent pkg recipe to download latest GoogleChrome and import it into the JSS.
Identifier: com.github.smithjw.jss.Google_Chrome
ParentRecipe: com.github.smithjw.pkg.Google_Chrome
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome
  CATEGORY: Productivity
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  OS_REQUIREMENTS: 10.16.x,10.15.x,10.14.x,10.13.x,10.12.x,10.11.x,10.10.x
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: Google Chrome is a browser that combines a minimal design with sophisticated technology to make the web faster, safer, and easier.
  SELF_SERVICE_ICON: Google Chrome.png

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: JSS Recipes will cease working soon and this recipe will be removed on the 30th of September

  - Processor: JSSImporter
    Arguments:
      category: '%CATEGORY%'
      groups:
        - name: '%GROUP_NAME%'
          smart: true
          template_path: '%GROUP_TEMPLATE%'
      policy_category: '%POLICY_CATEGORY%'
      policy_template: '%POLICY_TEMPLATE%'
      prod_name: '%NAME%'
      self_service_description: '%SELF_SERVICE_DESCRIPTION%'
      self_service_icon: '%SELF_SERVICE_ICON%'
