Identifier: com.github.smithjw.jamf.Google_Chrome-patch
ParentRecipe: com.github.smithjw.jamf.Google_Chrome
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome
  SOFTWARE_TITLE: 'Google_Chrome'
  CATEGORY: Browsers
  PATCH_NAME: 'Auto-Update - %NAME%'
  PATCH_SOFTWARE_TITLE: '%NAME%'
  PATCH_TEMPLATE: 'PatchTemplate-selfservice.xml'
  POLICY_NAME: '%NAME%'
  PATCH_ENABLED: 'true'
  PATCH_UNKNOWN: 'true'
  PATCH_GRACE: '20'
  PATCH_ICON_POLICY_NAME: '%NAME%'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
    Arguments:
      patch_name: '%PATCH_NAME%'
      patch_template: '%PATCH_TEMPLATE%'
      patch_softwaretitle: '%PATCH_SOFTWARE_TITLE%'
      patch_icon_policy_name: '%PATCH_ICON_POLICY_NAME%'
