Description: Downloads latest Google Chrome enterprise package and renames it based on the Chrome version.
Identifier: com.github.smithjw.pkg.Google_Chrome
ParentRecipe: com.github.smithjw.download.Google_Chrome
MinimumVersion: '2.9'

Input:
  NAME: Google Chrome
  SOFTWARETITLE: Google_Chrome

Process:
  - Processor: com.github.dataJAR-recipes.Shared Processors/DistributionPkgInfo
    Arguments:
      pkg_path: '%pathname%'

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARETITLE%-%version%.pkg'
      source_pkg: '%pathname%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
