Description: Downloads latest Google Chrome enterprise package and renames it based on the Chrome version.
Identifier: com.github.smithjw.pkg.Google_Chrome
ParentRecipe: com.github.smithjw.download.Google_Chrome
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/%PKGPAYLOADNAME%.pkg/Payload'

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%.app'

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARETITLE%-%version%.pkg'
    source_pkg: '%pathname%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
