Description: Download, extract, and package Xcode into a DMG
Identifier: com.github.smithjw.pkg.Xcode
ParentRecipe: com.github.smithjw.extract.Xcode
MinimumVersion: '2.3'

Input:
  NAME: Xcode

Process:
  - Processor: FileMover
    Arguments:
      source: '%found_filename%'
      target: '%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%-%major_version%.%minor_version%.app'

  - Processor: DmgCreator
    Arguments:
      dmg_path: '%RECIPE_CACHE_DIR%/%NAME%-%major_version%.%minor_version%.dmg'
      dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/%NAME%'
