Description: Download, extract, package, then upload Xcode to Jamf.
Identifier: com.github.smithjw.jss.Xcode
ParentRecipe: com.github.smithjw.pkg.Xcode
MinimumVersion: '2.3'

Input:
  NAME: Xcode
  CATEGORY: Developer
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  OS_REQUIREMENTS: '11.3'
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: PolicyTemplate.xml
  SCRIPT_NAME: 'autopkg_xcode_postinstall.sh'
  SCRIPT_TEMPLATE: 'XcodeScriptTemplate.xml'
  SELF_SERVICE_DESCRIPTION: Xcode includes everything developers need to create great applications for Mac, iPhone, iPad, Apple TV, and Apple Watch.
  SELF_SERVICE_ICON: '%NAME%.png'

Process:
  - Processor: JSSImporter
    Arguments:
      category: '%CATEGORY%'
      groups:
        - name: '%GROUP_NAME%'
          smart: true
          template_path: '%GROUP_TEMPLATE%'
      policy_category: '%POLICY_CATEGORY%'
      policy_template: '%POLICY_TEMPLATE%'
      prod_name: '%NAME%'
      scripts:
        - name: '%SCRIPT_NAME%'
          template_path: '%SCRIPT_TEMPLATE%'
      self_service_description: '%SELF_SERVICE_DESCRIPTION%'
      self_service_icon: '%SELF_SERVICE_ICON%'
