Description: Downloads latest version of the Wireshark DMG and creates a Package.
Identifier: com.github.smithjw.pkg.wireshark
ParentRecipe: com.github.smithjw.download.wireshark
MinimumVersion: '2.3'

Input:
  NAME: Wireshark

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: AppPkgCreator

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'
