Description: Downloads latest version of Wireshark as a DMG and creates a Package.
Identifier: com.github.smithjw.pkg.Wireshark
ParentRecipe: com.github.homebysix.download.Wireshark
MinimumVersion: '2.3'

Input:
  NAME: Wireshark

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: AppPkgCreator

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'
