Identifier: com.github.smithjw.jamf.Azure_Data_Studio
ParentRecipe: com.github.davidbpirie.pkg.AzureDataStudio
MinimumVersion: '2.3'

Input:
  NAME: Azure Data Studio
  SOFTWARE_TITLE: Azure_Data_Studio
  CATEGORY: Development
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroup-update-smart.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: Policy-install-latest.xml
  POLICY_NAME: 'Install Latest %NAME%'
  POLICY_RUN_COMMAND: ' '
  SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_DESCRIPTION: 'Azure Data Studio is a cross-platform database tool for data professionals who use on-premises and cloud data platforms on Windows, macOS, and Linux.'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  UPDATE_PREDICATE: 'pkg_uploaded == False'

Process:
  - Processor: FileMover
    Arguments:
      source: '%pkg_path%'
      target: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
