Description: Downloads the latest version of Microsoft's Edge installer package and renames the package.
Identifier: com.github.smithjw.pkg.microsoft_edge
ParentRecipe: com.github.rtrouton.download.microsoftedge
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Edge
  SOFTWARE_TITLE: Microsoft_Edge

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/unpack'
      flat_pkg_path: '%pathname%'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/downloads/unpack/*Edge*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/payload'
      pkg_payload_path: '%found_filename%/Payload'

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/downloads/payload/Microsoft Edge.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/downloads/unpack'
        - '%RECIPE_CACHE_DIR%/downloads/payload'
