Description: Downloads the latest version of the Microsoft Defender ATP installer package and renames the package.
Identifier: com.github.smithjw.pkg.microsoft_defender
ParentRecipe: com.github.rtrouton.download.microsoftdefenderatp
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Defender
  SOFTWARE_TITLE: Microsoft_Defender

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      flat_pkg_path: '%pathname%'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unpack/*wdav*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      pkg_payload_path: '%found_filename%/Payload'

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/payload/Microsoft Defender ATP.app/Contents/Info.plist'
      plist_version_key: 'CFBundleShortVersionString'

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
