Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.smithjw.jamf.Microsoft_OneDrive
ParentRecipe: com.github.rtrouton.pkg.microsoftonedrive
MinimumVersion: '2.3'

Input:
  NAME: Microsoft OneDrive
  SOFTWARE_TITLE: Microsoft_OneDrive
  SOFTWARETITLE: OneDrive
  CATEGORY: Collaboration
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroup-update-smart.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: Policy-install-latest.xml
  POLICY_NAME: 'Install Latest %NAME%'
  POLICY_RUN_COMMAND: ' '
  SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_DESCRIPTION:
    Get to your files from anywhere, on any device, with Microsoft OneDrive.
    Share and work together with anyone in your work and life. With OneDrive for Business,
    you also get storage for your work files so you can share and collaborate on them with
    other people at work. The OneDrive app for Mac makes it easy to work with your OneDrive
    files on your Mac.
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  UPDATE_PREDICATE: 'pkg_uploaded == False'

Process:
  - Processor: FileMover
    Arguments:
      source: '%pkg_path%'
      target: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
