Identifier: com.github.smithjw.pkg.KeePassXC
ParentRecipe: com.github.n8felton.download.KeePassXC
MinimumVersion: '2.3'

Input:
  NAME: KeePassXC

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%-%version%.pkg'
