<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.smithjw.selfservice.jss.1Password</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Utility</string>
		<key>MAJOR_VERSION</key>
		<string>6</string>
		<key>NAME</key>
		<string>1Password SS</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.12.x,10.11.x,10.10.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Utilities</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate-selfservice.xml</string>
		<key>PREFERRED_SOURCE</key>
		<string>Amazon CloudFront</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>1Password for Mac lets you keep all of your log-ins in one place, so you'll never have to worry about forgetting passwords again. And all of the information you enter into this app is protected by a master password, which means you won't have to worry about unauthorized access, either.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>1Password.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jss-recipes.jss.1Password</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>OnePasswordURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>c01581c7ae76490ef20ec56009662f987d010b76</string>
				<key>path</key>
				<string>/Users/james/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/AgileBits/OnePasswordURLProvider.py</string>
				<key>sha256_hash</key>
				<string>7c61db744c114eaeade00019d0bacb440247613901907c4e7296d215c3e4c4ba</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.jss-recipes.jss.1Password</key>
			<dict>
				<key>git_hash</key>
				<string>77051f3f5a59b79929b7086e788d14cc36590028</string>
				<key>path</key>
				<string>/Users/james/Library/AutoPkg/RecipeRepos/com.github.autopkg.jss-recipes/1Password/1Password.jss.recipe</string>
				<key>sha256_hash</key>
				<string>2aa0776beb0717b4a55d8ae7fa41112f9bb5d4f605611a3dc7cdf9787b0e223f</string>
			</dict>
			<key>io.github.hjuutilainen.download.1Password</key>
			<dict>
				<key>git_hash</key>
				<string>5913ae54aba5874017e3d5f9ebda48ea535a8764</string>
				<key>path</key>
				<string>/Users/james/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/AgileBits/1Password.download.recipe</string>
				<key>sha256_hash</key>
				<string>29cb0f84cb31d3e4bf5a56938f0a5a262d07f8671fe61043adcdee070ed0bace</string>
			</dict>
			<key>io.github.hjuutilainen.pkg.1Password</key>
			<dict>
				<key>git_hash</key>
				<string>4ed9c738bf87ebdcd547c1fe64dbfcca997e9d1e</string>
				<key>path</key>
				<string>/Users/james/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/AgileBits/1Password.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>9fb6fd668d501a23bd24a002e0ba06ff72de9c986a95cbb9324b0ce41e29da7f</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
