Description: Downloads the latest version of iTerm2 and creates a package.
Identifier: com.github.smithjw.pkg.iterm2
ParentRecipe: com.github.smithjw.download.iterm2
MinimumVersion: '2.9'

Input:
  NAME: iTerm2

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/iTerm.app'
      force_pkg_build: true
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
