Description: Downloads the latest version of iTerm2 and creates a package.
Identifier: com.github.smithjw.pkg.iterm2
ParentRecipe: com.github.smithjw.download.iterm2
MinimumVersion: '2.3'

Input:
  NAME: iTerm2

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/unpack/iTerm.app'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
    - '%RECIPE_CACHE_DIR%/payload'