<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v1.0.4 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of Microsoft Remote Desktop Beta and imports it into your JSS.</string>
    <key>Identifier</key>
    <string>com.github.smithjw-recipes.jss.MicrosoftRemoteDesktopBeta</string>
    <key>Input</key>
    <dict>
      <key>CATEGORY</key>
      <string>Productivity</string>
      <key>GROUP_NAME</key>
      <string>%NAME%-update-smart</string>
      <key>GROUP_TEMPLATE</key>
      <string>SmartGroupTemplate.xml</string>
      <key>NAME</key>
      <string>Microsoft Remote Desktop Beta</string>
      <key>POLICY_CATEGORY</key>
      <string>Testing</string>
      <key>POLICY_TEMPLATE</key>
      <string>PolicyTemplate.xml</string>
      <key>SELF_SERVICE_DESCRIPTION</key>
      <string>Connect to Windows machines.</string>
      <key>SELF_SERVICE_ICON</key>
      <string>%NAME%.png</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.smithjw.smithjw-recipes.pkg.MicrosoftRemoteDesktopBeta</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>DeprecationWarning</string>
        <key>Arguments</key>
        <dict>
          <key>warning_message</key>
          <string>JSS Recipes will cease working soon and this recipe will be removed on the 30th of September</string>
        </dict>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>category</key>
          <string>%CATEGORY%</string>
          <key>groups</key>
          <array>
            <dict>
              <key>name</key>
              <string>%GROUP_NAME%</string>
              <key>smart</key>
              <true />
              <key>template_path</key>
              <string>%GROUP_TEMPLATE%</string>
            </dict>
          </array>
          <key>policy_category</key>
          <string>%POLICY_CATEGORY%</string>
          <key>policy_template</key>
          <string>%POLICY_TEMPLATE%</string>
          <key>prod_name</key>
          <string>%NAME%</string>
          <key>self_service_description</key>
          <string>%SELF_SERVICE_DESCRIPTION%</string>
          <key>self_service_icon</key>
          <string>%SELF_SERVICE_ICON%</string>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
    </array>
  </dict>
</plist>
