<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of Little Snitch and creates a pkg.</string>
    <key>Identifier</key>
    <string>com.github.smithjw.download.LittleSnitch</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Little Snitch</string>
      <key>USER_AGENT</key>
      <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://www.obdev.at/products/littlesnitch/download.html</string>
          <key>request_headers</key>
          <dict>
            <key>User-Agent</key>
            <string>Safari 8.0.2</string>
          </dict>
          <key>re_pattern</key>
          <string>(LittleSnitch-*\d.\d.\d.dmg)</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%NAME%.dmg</string>
          <key>url</key>
          <string>https://www.obdev.at/downloads/littlesnitch/%match%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>AppDmgVersioner</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_path</key>
          <string>%pathname%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>overwrite</key>
          <string>true</string>
          <key>source_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
