<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Little Snitch 5 and builds a pkg.
        Please Note: In order to minimise user requests on first launch you'll need to
        deploy a System Extension Profile and Content Filter profile with this title
        Minimum OS is macOS 11.x</string>
        <key>Identifier</key>
        <string>com.github.smithjw.pkg.LittleSnitch5</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Little Snitch 5</string>
            <key>USER_AGENT</key>
            <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.smithjw.download.LittleSnitch5</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>AppDmgVersioner</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Applications</key>
                        <string>0775</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Little Snitch.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/Little Snitch.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>Applications/Little Snitch.app</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>admin</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                        </array>
                        <key>id</key>
                        <string>%bundleid%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
