<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Little Snitch and builds a pkg.</string>
        <key>Identifier</key>
        <string>com.github.smithjw.pkg.LittleSnitch</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Little Snitch</string>
            <key>USER_AGENT</key>
            <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.smithjw.download.LittleSnitch</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>AppDmgVersioner</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Applications</key>
                        <string>0775</string>
                        <key>Library</key>
                        <string>0755</string>
                        <key>Library/Extensions</key>
                        <string>0755</string>
                        <key>Library/LaunchAgents</key>
                        <string>0755</string>
                        <key>Library/LaunchDaemons</key>
                        <string>0755</string>
                        <key>Library/Little Snitch</key>
                        <string>0755</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Little Snitch Installer.app/Contents/Resources/Little Snitch Agent.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Library/Little Snitch/Little Snitch Agent.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Little Snitch Installer.app/Contents/Resources/Little Snitch Daemon.bundle</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Library/Little Snitch/Little Snitch Daemon.bundle</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Little Snitch Installer.app/Contents/Resources/Little Snitch Helper.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Library/Little Snitch/Little Snitch Helper.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Little Snitch Installer.app/Contents/Resources/Little Snitch Network Monitor.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Library/Little Snitch/Little Snitch Network Monitor.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Little Snitch Installer.app/Contents/Resources/Little Snitch Software Update.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Library/Little Snitch/Little Snitch Software Update.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Little Snitch Installer.app/Contents/Resources/Little Snitch Uninstaller.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Library/Little Snitch/Little Snitch Uninstaller.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Little Snitch Installer.app/Contents/Resources/LittleSnitch.kext</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Library/Extensions/LittleSnitch.kext</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Little Snitch Installer.app/Contents/Resources/Little Snitch Configuration.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/Little Snitch Configuration.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PlistEditor</string>
                <key>Arguments</key>
                <dict>
                    <key>output_plist_path</key>
                    <string>%pkgroot%/Library/LaunchAgents/at.obdev.LittleSnitchHelper.plist</string>
                    <key>plist_data</key>
                    <dict>
                        <key>KeepAlive</key>
                        <true/>
                        <key>Label</key>
                        <string>at.obdev.LittleSnitchHelper</string>
                        <key>ProgramArguments</key>
                        <array>
                            <string>/Library/Little Snitch/Little Snitch Helper.app/Contents/MacOS/Little Snitch Helper</string>
                        </array>
                        <key>RunAtLoad</key>
                        <true/>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PlistEditor</string>
                <key>Arguments</key>
                <dict>
                    <key>output_plist_path</key>
                    <string>%pkgroot%/Library/LaunchAgents/at.obdev.LittleSnitchUIAgent.plist</string>
                    <key>plist_data</key>
                    <dict>
                        <key>KeepAlive</key>
                        <true/>
                        <key>Label</key>
                        <string>at.obdev.LittleSnitchUIAgent</string>
                        <key>ProgramArguments</key>
                        <array>
                            <string>/Library/Little Snitch/Little Snitch Agent.app/Contents/MacOS/Little Snitch Agent</string>
                        </array>
                        <key>RunAtLoad</key>
                        <true/>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PlistEditor</string>
                <key>Arguments</key>
                <dict>
                    <key>output_plist_path</key>
                    <string>%pkgroot%/Library/LaunchDaemons/at.obdev.littlesnitchd.plist</string>
                    <key>plist_data</key>
                    <dict>
                        <key>KeepAlive</key>
                        <true/>
                        <key>Label</key>
                        <string>at.obdev.littlesnitchd</string>
                        <key>ProgramArguments</key>
                        <array>
                            <string>/Library/Little Snitch/Little Snitch Daemon.bundle/Contents/MacOS/Little Snitch Daemon</string>
                        </array>
                        <key>RunAtLoad</key>
                        <true/>
                        <key>StandardErrorPath</key>
                        <string>/Library/Logs/LittleSnitchDaemon.log</string>
                        <key>StandardOutPath</key>
                        <string>/Library/Logs/LittleSnitchDaemon.log</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgInfoCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>pkgtype</key>
                    <string>flat</string>
                    <key>template_path</key>
                    <string>%RECIPE_DIR%/PackageInfoTemplate</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>Applications/Little Snitch Configuration.app</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>admin</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/Little Snitch/Little Snitch Agent.app</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/Little Snitch/Little Snitch Daemon.bundle</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/Little Snitch/Little Snitch Helper.app</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/Little Snitch/Little Snitch Network Monitor.app</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/Little Snitch/Little Snitch Software Update.app</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/Little Snitch/Little Snitch Uninstaller.app</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/Extensions/LittleSnitch.kext</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/LaunchAgents/at.obdev.LittleSnitchHelper.plist</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0644</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/LaunchAgents/at.obdev.LittleSnitchUIAgent.plist</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0644</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Library/LaunchDaemons/at.obdev.littlesnitchd.plist</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0644</string>
                            </dict>
                        </array>
                        <key>id</key>
                        <string>%bundleid%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
